//--------------------------------------------------------------------------
//
// クラス	: ログクラス(インプリメント)
//
// クラス名 : CLogger
//
// ファイル : Logger.cpp
//
// 内  容	: 拡張機能(Plugin)管理。
//			  ログ設定ファイルの設定に従い、ファイル及びコンソールに
//			  ログを出力する。
//
//
// 改訂履歴
//	 日付		担当者	  内容
//	 2005/8/5	 Y.Taira  新規作成
//	 2005/10/7	 Y.Taira  出力のロック位置の変更
//--------------------------------------------------------------------------
#include "StdAfx.h"
#include "ExtRoleBox.h"

ExtRoleBox::ExtRoleBox(void)
{
}

ExtRoleBox::~ExtRoleBox(void)
{
}
